Autodesk.Navisworks.Api.InfoPropertyCategoryCollection
A collection of Autodesk.Navisworks.Api.InfoPropertyCategory objects.

Autodesk.Navisworks.Api.InfoPropertyCategoryCollection.#ctor
Create an empty collection

Autodesk.Navisworks.Api.InfoPropertyCategoryCollection.Count
Gets the number of elements contained in the collection.

Autodesk.Navisworks.Api.InfoPropertyCategoryCollection.GetEnumerator
Returns an enumerator that can iterate through the collection.
Returns: An IEnumerator that can be used to iterate through the collection.

Autodesk.Navisworks.Api.InfoPropertyCategoryCollection.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.InfoPropertyCategoryCollection.Item(System.Int32)
